#include <iostream>
using namespace std;

void menu_system()                    //系统主页面
{
	system("cls");
	cout<<"\n"<<"\n";
	cout<<"                         **************************  "<<endl;
	cout<<"                         |       Tach版           |"<<endl;
	cout<<"                         |     图书馆管理系统     |                        "<<endl;
	cout<<"                         |                        |"<<endl;
	cout<<"                         **************************  "<<endl;
	cout<<"\n"<<"\n";
	cout<<"——————————————————————————————————————"<<endl;
	cout<<endl;
	cout<<"                               请按序号选择："<<"\n"<<endl;
	cout<<"                               1.读者登录"<<endl;
	cout<<"                               2.工作人员登录"<<endl;
	cout<<"                               3.管理人员登录"<<endl;
	cout<<"                               4.注册读者"<<endl;
	cout<<"                               5.退出系统"<<"\n"<<endl;
	cout<<"——————————————————————————————————————"<<endl;
	cout<<"         \n请选择序号："<<endl;

}

void menu_reader()                         //读者系统主页面
{
system("cls");
    cout<<"\n                             成功登录读者系统:                                "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ---------------------------------------- "<<endl;
	cout<<"　　　　　                1.查找馆藏书目       　　　　　　   "<<endl;
	cout<<"　　　　　                2.查看个人借阅信息     　　　　　　 "<<endl;
	cout<<"　　　　　                3.修改个人信息　　　　　　          "<<endl;
	cout<<"　　　　　                4.查看个人信息　　　　　            "<<endl;
	cout<<"　　　　　                5.退出登录并返回上层　　　　　　    "<<endl;
	cout<<"                    ---------------------------------------- "<<endl;
	cout<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"请选择:"<<endl;

}
void menu_worker()                         //工作人员系统主页面
{
	system("cls");
    cout<<"\n                           成功登录工作人员系统:                              "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.借书       　　　　　　          "<<endl;
	cout<<"　　　　　               2.还书      　　　　　　           "<<endl;
	cout<<"　　　　　               3.查找馆藏书目　　　　　　         "<<endl;
	cout<<"　　　　　               4.查看读者信息　　　　　           "<<endl;
	cout<<"　　　　　               5.退出登录返回上层　　　　　　     "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"请选择:"<<endl;

}


void menu_manger()                         //管理人员系统主页面
{
	system("cls");
    cout<<"\n                           成功登录管理员系统:                            "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                     ----------------------------------------"<<endl;
	cout<<"　　　　　               1.查找馆藏书目       　　　　　　   "<<endl;
	cout<<"　　　　　               2.更新馆藏书目      　　　　　　    "<<endl;
	cout<<"　　　　　               3.修改读者信息　　　　　　          "<<endl;
	cout<<"　　　　　               4.修改工作人员信息    　　　　　　  "<<endl;
	cout<<"　　　　　               5.返回上层　　　　　　              "<<endl;
	cout<<"                     ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;
}

void menu_search_book()
{
system("cls");
    cout<<"\n                             查找馆藏书目:                                    "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.根据书号查询      　　　　　　   "<<endl;
	cout<<"                         2.根据书名检索                     "<<endl;
	cout<<"　　　　　               3.显示所有馆藏书目     　　　　　  "<<endl;
	cout<<"　　　　　               4.返回上层　　　　　　             "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;
}
void menu_update_book()
{
 system("cls");
    cout<<"\n                             更新馆藏书目:                                    "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.添加书目      　　　　　　       "<<endl;
	cout<<"　　　　　               2.修改书目     　　　　　　        "<<endl;
	cout<<"　　　　　               3.返回上层　　　　　　             "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;
}

void menu_change_book()
{
   system("cls");
    cout<<"\n                             修改书目:                                        "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.修改书名       　　　　　　      "<<endl;
	cout<<"　　　　　               2.修改作者     　　　　　　        "<<endl;
	cout<<"　　　　　               3.修改馆藏数目　　　　　　         "<<endl;
	cout<<"　　　　　               4.修改出版社　　　　　　           "<<endl;
	cout<<"　　　　　               5.返回上层　　　　　　             "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;
}
void menu_change_reader()
{
    system("cls");
    cout<<"\n                             修改读者个人信息:                                "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.修改年龄       　　　　　　      "<<endl;
	cout<<"　　　　　               2.修改性别      　　　　　　       "<<endl;
	cout<<"　　　　　               3.修改密码　　　　　　             "<<endl;
	cout<<"　　　　　               4.返回上层　　　　　　             "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;

}
void menu_change_worker()
{
    system("cls");
    cout<<"\n                             修改工作人员:                                    "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.添加工作人员      　　　　　     "<<endl;
	cout<<"　　　　　               2.删除工作人员      　　　　　　   "<<endl;
	cout<<"　　　　　               3.返回上层　　　　　　             "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;
}
void menu_change_reader_1()
{
    system("cls");
    cout<<"\n                              修改读者:                                       "<<endl;
	cout<<"------------------------------------------------------------------------------- "<<endl;
	cout<<"                                                                                "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"　　　　　               1.修改年龄       　　　　　　      "<<endl;
	cout<<"　　　　　               2.修改性别     　　　　　　        "<<endl;
	cout<<"　　　　　               3.修改密码　　　　　　             "<<endl;
	cout<<"　　　　　               4.删除读者　　　　　　             "<<endl;
	cout<<"　　　　　               5.返回上层　　　　　　             "<<endl;
	cout<<"                    ----------------------------------------"<<endl;
	cout<<"请选择:"<<endl;

}